random-benchmark/logs/Qwen2.5-14B-Instruct-4096-gpu4-results.log
Running benchmark with num_prompt=1, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 1/1 [00:18<00:00, 18.61s/it]
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  18.61     
Total input tokens:                      4096      
Total generated tokens:                  512       
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         27.52     
Total Token throughput (tok/s):          247.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          1058.21   
Median TTFT (ms):                        1058.21   
P99 TTFT (ms):                           1058.21   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.34     
Median TPOT (ms):                        34.34     
P99 TPOT (ms):                           34.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.34     
Median ITL (ms):                         32.37     
P99 ITL (ms):                            55.34     
==================================================
Completed benchmark with num_prompt=1, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=2, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 2/2 [00:19<00:00,  9.70s/it]
============ Serving Benchmark Result ============
Successful requests:                     2         
Benchmark duration (s):                  19.41     
Total input tokens:                      8192      
Total generated tokens:                  1020      
Request throughput (req/s):              0.10      
Output token throughput (tok/s):         52.55     
Total Token throughput (tok/s):          474.63    
---------------Time to First Token----------------
Mean TTFT (ms):                          1886.32   
Median TTFT (ms):                        1886.32   
P99 TTFT (ms):                           1886.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.42     
Median TPOT (ms):                        34.42     
P99 TPOT (ms):                           34.56     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.32     
Median ITL (ms):                         36.38     
P99 ITL (ms):                            50.73     
==================================================
Completed benchmark with num_prompt=2, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=4, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 4/4 [00:21<00:00,  5.45s/it]
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  21.79     
Total input tokens:                      16384     
Total generated tokens:                  2045      
Request throughput (req/s):              0.18      
Output token throughput (tok/s):         93.83     
Total Token throughput (tok/s):          845.57    
---------------Time to First Token----------------
Mean TTFT (ms):                          2835.82   
Median TTFT (ms):                        2835.85   
P99 TTFT (ms):                           3758.38   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.16     
Median TPOT (ms):                        37.13     
P99 TPOT (ms):                           39.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.32     
Median ITL (ms):                         35.84     
P99 ITL (ms):                            49.61     
==================================================
Completed benchmark with num_prompt=4, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=6, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=6, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 6/6 [00:22<00:00,  3.67s/it]
============ Serving Benchmark Result ============
Successful requests:                     6         
Benchmark duration (s):                  22.05     
Total input tokens:                      24576     
Total generated tokens:                  3063      
Request throughput (req/s):              0.27      
Output token throughput (tok/s):         138.93    
Total Token throughput (tok/s):          1253.63   
---------------Time to First Token----------------
Mean TTFT (ms):                          3776.94   
Median TTFT (ms):                        3752.35   
P99 TTFT (ms):                           5658.35   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.87     
Median TPOT (ms):                        35.91     
P99 TPOT (ms):                           39.83     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.09     
Median ITL (ms):                         25.78     
P99 ITL (ms):                            51.78     
==================================================
Completed benchmark with num_prompt=6, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=8, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=8, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 8/8 [00:25<00:00,  3.17s/it]
============ Serving Benchmark Result ============
Successful requests:                     8         
Benchmark duration (s):                  25.39     
Total input tokens:                      32768     
Total generated tokens:                  4093      
Request throughput (req/s):              0.32      
Output token throughput (tok/s):         161.21    
Total Token throughput (tok/s):          1451.84   
---------------Time to First Token----------------
Mean TTFT (ms):                          4773.85   
Median TTFT (ms):                        4765.21   
P99 TTFT (ms):                           7594.41   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.37     
Median TPOT (ms):                        40.36     
P99 TPOT (ms):                           46.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.44     
Median ITL (ms):                         28.81     
P99 ITL (ms):                            54.05     
==================================================
Completed benchmark with num_prompt=8, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=10, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=10, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 10/10 [00:27<00:00,  2.74s/it]
============ Serving Benchmark Result ============
Successful requests:                     10        
Benchmark duration (s):                  27.41     
Total input tokens:                      40960     
Total generated tokens:                  5119      
Request throughput (req/s):              0.36      
Output token throughput (tok/s):         186.77    
Total Token throughput (tok/s):          1681.18   
---------------Time to First Token----------------
Mean TTFT (ms):                          5715.47   
Median TTFT (ms):                        5725.96   
P99 TTFT (ms):                           9488.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.46     
Median TPOT (ms):                        42.43     
P99 TPOT (ms):                           49.91     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.57     
Median ITL (ms):                         28.53     
P99 ITL (ms):                            53.03     
==================================================
Completed benchmark with num_prompt=10, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=12, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=12, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 12/12 [00:30<00:00,  2.52s/it]
============ Serving Benchmark Result ============
Successful requests:                     12        
Benchmark duration (s):                  30.29     
Total input tokens:                      49152     
Total generated tokens:                  6139      
Request throughput (req/s):              0.40      
Output token throughput (tok/s):         202.69    
Total Token throughput (tok/s):          1825.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          6692.99   
Median TTFT (ms):                        6685.68   
P99 TTFT (ms):                           11448.20  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.21     
Median TPOT (ms):                        46.19     
P99 TPOT (ms):                           55.44     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.03     
Median ITL (ms):                         31.33     
P99 ITL (ms):                            73.97     
==================================================
Completed benchmark with num_prompt=12, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=14, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=14, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 14/14 [00:32<00:00,  2.32s/it]
============ Serving Benchmark Result ============
Successful requests:                     14        
Benchmark duration (s):                  32.48     
Total input tokens:                      57344     
Total generated tokens:                  7002      
Request throughput (req/s):              0.43      
Output token throughput (tok/s):         215.59    
Total Token throughput (tok/s):          1981.22   
---------------Time to First Token----------------
Mean TTFT (ms):                          7753.88   
Median TTFT (ms):                        7620.44   
P99 TTFT (ms):                           13260.89  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          50.19     
Median TPOT (ms):                        48.64     
P99 TPOT (ms):                           75.37     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.02     
Median ITL (ms):                         31.86     
P99 ITL (ms):                            62.74     
==================================================
Completed benchmark with num_prompt=14, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=16, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=16, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 16/16 [00:36<00:00,  2.26s/it]
============ Serving Benchmark Result ============
Successful requests:                     16        
Benchmark duration (s):                  36.13     
Total input tokens:                      65536     
Total generated tokens:                  8024      
Request throughput (req/s):              0.44      
Output token throughput (tok/s):         222.08    
Total Token throughput (tok/s):          2035.90   
---------------Time to First Token----------------
Mean TTFT (ms):                          8814.89   
Median TTFT (ms):                        8600.54   
P99 TTFT (ms):                           15173.17  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          55.26     
Median TPOT (ms):                        53.92     
P99 TPOT (ms):                           85.01     
---------------Inter-token Latency----------------
Mean ITL (ms):                           53.72     
Median ITL (ms):                         37.56     
P99 ITL (ms):                            60.03     
==================================================
Completed benchmark with num_prompt=16, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=18, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=18, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 18/18 [00:43<00:00,  2.40s/it]
============ Serving Benchmark Result ============
Successful requests:                     18        
Benchmark duration (s):                  43.19     
Total input tokens:                      73728     
Total generated tokens:                  9212      
Request throughput (req/s):              0.42      
Output token throughput (tok/s):         213.30    
Total Token throughput (tok/s):          1920.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          10155.46  
Median TTFT (ms):                        10464.09  
P99 TTFT (ms):                           17407.16  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          64.68     
Median TPOT (ms):                        64.16     
P99 TPOT (ms):                           80.45     
---------------Inter-token Latency----------------
Mean ITL (ms):                           66.27     
Median ITL (ms):                         43.86     
P99 ITL (ms):                            117.10    
==================================================
Completed benchmark with num_prompt=18, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=20, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 20/20 [00:46<00:00,  2.32s/it]
============ Serving Benchmark Result ============
Successful requests:                     20        
Benchmark duration (s):                  46.33     
Total input tokens:                      81920     
Total generated tokens:                  10230     
Request throughput (req/s):              0.43      
Output token throughput (tok/s):         220.83    
Total Token throughput (tok/s):          1989.17   
---------------Time to First Token----------------
Mean TTFT (ms):                          10950.86  
Median TTFT (ms):                        11427.18  
P99 TTFT (ms):                           19293.85  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.28     
Median TPOT (ms):                        68.42     
P99 TPOT (ms):                           86.36     
---------------Inter-token Latency----------------
Mean ITL (ms):                           70.92     
Median ITL (ms):                         49.37     
P99 ITL (ms):                            133.23    
==================================================
Completed benchmark with num_prompt=20, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=22, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=22, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 22/22 [00:49<00:00,  2.26s/it]
============ Serving Benchmark Result ============
Successful requests:                     22        
Benchmark duration (s):                  49.82     
Total input tokens:                      90112     
Total generated tokens:                  11266     
Request throughput (req/s):              0.44      
Output token throughput (tok/s):         226.12    
Total Token throughput (tok/s):          2034.73   
---------------Time to First Token----------------
Mean TTFT (ms):                          12307.73  
Median TTFT (ms):                        12404.04  
P99 TTFT (ms):                           21580.02  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.41     
Median TPOT (ms):                        73.15     
P99 TPOT (ms):                           93.33     
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.78     
Median ITL (ms):                         53.31     
P99 ITL (ms):                            114.04    
==================================================
Completed benchmark with num_prompt=22, random-input-len=4096.
------------------------------------------------------------
Running benchmark with num_prompt=24, random-input-len=4096...
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-14B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=24, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 24/24 [00:52<00:00,  2.17s/it]
============ Serving Benchmark Result ============
Successful requests:                     24        
Benchmark duration (s):                  52.13     
Total input tokens:                      98304     
Total generated tokens:                  12254     
Request throughput (req/s):              0.46      
Output token throughput (tok/s):         235.04    
Total Token throughput (tok/s):          2120.62   
---------------Time to First Token----------------
Mean TTFT (ms):                          13258.90  
Median TTFT (ms):                        13397.21  
P99 TTFT (ms):                           23745.54  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          76.28     
Median TPOT (ms):                        75.88     
P99 TPOT (ms):                           97.76     
---------------Inter-token Latency----------------
Mean ITL (ms):                           77.80     
Median ITL (ms):                         49.80     
P99 ITL (ms):                            120.00    
==================================================
Completed benchmark with num_prompt=24, random-input-len=4096.
------------------------------------------------------------